#include <stdio.h>
#include <stdlib.h>
#include <string.h>
void printWelcome() {
    printf("\n");
    printf("  ██╗    ██╗ █████╗ ██████╗ ███╗   ███╗███████╗██╗  ██╗███████╗██╗     ██╗\n");
    printf("  ██║    ██║██╔══██╗██╔══██╗████╗ ████║██╔════╝██║  ██║██╔════╝██║     ██║\n");
    printf("  ██║ █╗ ██║███████║██████╔╝██╔████╔██║███████╗███████║█████╗  ██║     ██║\n");
    printf("  ██║███╗██║██╔══██║██╔══██╗██║╚██╔╝██║╚════██║██╔══██║██╔══╝  ██║     ██║\n");
    printf("  ╚███╔███╔╝██║  ██║██║  ██║██║ ╚═╝ ██║███████║██║  ██║███████╗███████╗███████╗\n");
    printf("   ╚══╝╚══╝ ╚═╝  ╚═╝╚═╝  ╚═╝╚═╝     ╚═╝╚══════╝╚═╝  ╚═╝╚══════╝╚══════╝╚══════╝\n");
    printf("\n");
    printf("          YOUR SHELL. YOUR RULES. YOUR WORLD.  [ WarmShell v1.0 ]\n");
    printf("\n");
}


void printPrompt() {
    printf("WarmShell> ");
    fflush(stdout);
}

int main() {
  printWelcome();
  char input[1024];
    while(1){
    printPrompt();
    if(fgets(input,sizeof(input),stdin)==NULL){break;}
    input[strcspn(input, "\n")] = 0;
    if(input[0]=='\0') continue;
    printf("Not a command for now \n");
  }
    return 0;
}
